[
	{
		"type": 					["railway", "personal"], 
		"name": 					"Flota Ferroviaria", 
		"datefrom": 				"2016-07-01", 
		"dateto": 					null,
		"version": 					"v2", 
		"frameworks": 				["FM5strap", "AngularJS", "jQuery"], 
		"shortDescription": 		"Proyecto que muestra la composición de la flota de ferrocarriles en el AMBA.", 
		"description": 				"Uno de mis proyectos más recientes y más valorados por mí dado a que quiero concentrar la mayor cantidad de información sobre la flota de los ferrocarriles del Área Metropolitana de Buenos Aires. Junto a ello se van agregando más datos y más funciones para hacer más fácil el encontrar un coche o saber en qué estado está cierta formación. ", 
		"image": 					"flota-ferroviaria-v2.0", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/flota-ferroviaria", 
		"repo": 					"http://github.com/Fermoto5HD/flota-ferroviaria"
	}, {
		"type": 					"lantalks", 
		"name": 					"Lantalksify", 
		"frameworks": 				["Bootstrap v3", "Grunt"], 
		"datefrom": 				"2016-06-01", 
		"dateto": 					null, 
		"version": 					"v1", 
		"shortDescription": 		"Llevo a cabo un proyecto ambicioso para unificar y homogeneizar los sitios del multimedio.", 
		"description": 				"Al igual que FM5strap, se realiza tomando la base de Bootstrap-sass v3 y se van adaptando los elementos según las necesidades que tenemos en el multimedio. ", 
		"image": 					"lt-lantalksify-v1.0", 
		"link": 					"http://lantalks.com/webmedia/lantalksify", 
		"repo": 					"http://sum1.lantalkswebmedia.xyz/lt-webmedia/lantalksify"
	}, {
		"type": 					"personal", 
		"name": 					"Sitio Personal", 
		"frameworks": 				["FM5strap", "AngularJS", "jQuery"], 
		"datefrom": 				"2016-06-01", 
		"dateto": 					null, 
		"version": 					"v5", 
		"shortDescription": 		"Renovación desde cero de mi página personal, incorporando elementos interactivos que cambian con el paso del tiempo.", 
		"description": 				"Se plantea el cambio del framework a Bootstrap (y luego a FM5strap) dado a los resultados que fuí obteniendo en un par de sitios adicionales en paralelo. Trabajé más en usar los datos de las APIs para agregar interacción al sitio y puse más foco en el responsive del sitio para que la experiencia sea aún mejor. ", 
		"image": 					"sitiopersonal-v5.0", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/sitiopersonal/v4", 
		"repo": 					"http://github.com/Fermoto5HD/SitioPersonal"
	}, {
		"type": 					["railway", "UNSAM"], 
		"name": 					"Transporte 2 - T.P. final", 
		"datefrom": 				"2016-06-01", 
		"dateto": 					null,
		"version": 					"v1", 
		"shortDescription": 		"En este trabajo se puntualizó en el gran potencial que tiene el NOA y el protagonismo que puede tener el Belgrano Cargas para su economía. ", 
		"description": 				"Fue realizado con Reveal.js, un framework que permite realizar presentaciones interactivas en el browser y agregar material audiovisual en el slide. ", 
		"image": 					"unsam-transporte2-tpfinal", 
		"link": 					"http://Fermoto5HD.github.io/transporte2-tpfinal", 
		"repo": 					"http://github.com/Fermoto5HD/transporte2-tpfinal" 
	}, {
		"type": 					["railway", "UNSAM"], 
		"name": 					"Administración de Servicios de Cargas - T.P. N°2", 
		"datefrom": 				"2016-05-01", 
		"dateto": 					null,
		"description": 				"Segundo trabajo práctico digitalizado en formato webapp. Se trabajó la parte analítica mediante jQuery y variables con objetos para almacenar una distinta cantidad de grupos de variables. ", 
		"link": 					"portfolio/cursadaUNSAM/admcargas-tp2", 
		"repo": 					"http://github.com/Fermoto5HD/admcargas-tp2" 
	}, {
		"type": 					"personal", 
		"name": 					"FM5strap", 
		"datefrom": 				"2016-05-01", 
		"dateto": 					null,
		"version": 					"v1", 
		"frameworks": 				["Bootstrap v4", "Grunt"], 
		"shortDescription": 		"Framework basado en Bootstrap v4 para mis sitios personales, incluyendo este mismo.", 
		"description": 				"Después de ver que al prototipar para diferentes sitios propios usando Bootstrap v4 usaba los mismos estilos para cada sitio decidí empezar a armar una variante de Bootstrap para usarlo en los demás sitios sin tener que ir copiando todo el tiempo los mismos estilos. Para eso modifiqué varias partes de la estética, y también, de los scripts de compilación para exportar otras características como la marca y los íconos.", 
		"image": 					"fm5strap-v1.0", 
		"link": 					"/FM5strap", 
		"linkonsite": 				true, 
		"repo":		 				"http://github.com/Fermoto5HD/FM5strap"
	}, {
		"type": 					["railway", "UNSAM"], 
		"name": 					"Infraestructura 1 - T.P. N°1", 
		"datefrom": 				"2016-04-01", 
		"dateto": 					null,
		"description": 				"Este fue mi primer trabajo práctico digitalizado en formato webapp. Se trabajó mucho con las funciones de cálculo por jQuery y la interacción por medio de tooltips y popovers para explicar de donde provienen algunos resultados. <br>Más tarde fue integrado en mi sitio personal con motivo de la unificación de sitios. ", 
		"link": 					"portfolio/cursadaUNSAM/infra1-tp1", 
		"linkonsite":				true, 
		"repo": 					"http://github.com/Fermoto5HD/infra-tp1" 
	}, {
		"type": 					["railway"], 
		"name": 					"Flota Ferroviaria", 
		"datefrom": 				"2016-05-01", 
		"dateto": 					"2016-07-01",
		"version": 					"v1", 
		"frameworks": 				["Bootstrap v4", "Polymer", "jQuery"], 
		"shortDescription": 		"Proyecto que muestra la composición de la flota de ferrocarriles en el AMBA.", 
		"description": 				"En esta versión la adapté a Polymer, un framework de Google muy reciente con similitudes con Angular. Esta versión fue dada de baja por los distintos problemas de rendimiento y compatibilidad no sólo con browsers externos a WebKit, sino por el propio framework base de Polymer.", 
		"image": 					"flota-ferroviaria-v1.0", 
		"link": 					null, 
		"repo": 					"http://github.com/Fermoto5HD/flota-ferroviaria/tree/v1.x.x"
	}, {
		"type": 					["railway"], 
		"name": 					"Flota Ferroviaria", 
		"datefrom": 				"2016-04-01", 
		"dateto": 					"2016-05-01",
		"version": 					"v0.5", 
		"frameworks": 				["Bootstrap v4", "jQuery"], 
		"shortDescription": 		"Proyecto que muestra la composición de la flota de ferrocarriles en el AMBA.", 
		"description": 				"Fue creado con una base simple en jQuery, con acceso mediante hashes aunque bastante ", 
		"image": 					"flota-ferroviaria-v0.5", 
		"link": 					null, 
		"repo": 					null
	},	{
		"type": 					"railway", 
		"name": 					"Próximo Tren", 
		"datefrom": 				"2016-02-01", 
		"dateto": 					null,
		"version": 					"v1", 
		"frameworks": 				["Bootstrap v4", "jQuery", "MomentJS"], 
		"shortDescription": 		"Un proyecto propio en el cual decido armar una webapp alternativa a la app oficial de Trenes en Vivo pero con varias mejoras y cambios.", 
		"description": 				"Se utilizó Unsemantic como framework principal y Bootstrap como framework secundario, junto con MomentJS para el cálculo de tiempos restantes y atrasos de servicios. </p><p>Actualmente se reemplazó totalmente el framework Unsemantic por Bootstrap para simplificar el código y la estructura del sitio. </p><p>También se implementa una estética cuidada, adaptable al horario actual, con una clara coherencia en las paletas de colores utilizadas y disposición de elementos en las pantallas. </p><p>La marca Nuevos Ferrocarriles Argentinos es propiedad del Ministerio de Transporte de la Nación. ", 
		"image": 					"proximo-tren", 
		"link": 					"http://plataforma5.16mb.com/proximo-tren", 
		"repo": 					"http://github.com/Fermoto5HD/proximo-tren"
	}, {
		"type": 					"client", 
		"name": 					"Posada Kalua Praia", 
		"datefrom": 				"2016-01-01", 
		"dateto": 					null, 
		"frameworks": 				["Bootstrap v3", "jQuery"], 
		"shortDescription": 		"Uno de los sitios de veraneo más concurridos de Brasil requiere la renovación de su sitio web, por lo tanto decido proponer un diseño adaptado a estos últimos años. ", 
		"description": 				"El sitio es realizado en el tiempo record de un día, implementando Bootstrap y ModernizrJS, escenciales para su visualización en todo tipo de dispositivos. </p><p>Se utiliza un slider, modales para la galería de imágenes, y botones de acción directa para llamar a la posada o contactarse mediante correo con sólo tocar un botón. ", 
		"image": 					"kalua", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/kalua", 
		"repo": 					"http://github.com/Fermoto5HD/Kalua"
	}, {
		"type": 					"client", 
		"name": 					"Factor RH Creativo", 
		"datefrom": 				"2015-11-01", 
		"dateto": 					null, 
		"version": 					"v3", 
		"shortDescription": 		"Con motivo de mantener la innovación de la peluquería Factor RH Creativo, decido proponer una actualización de su sitio web. ", 
		"description": 				"El sitio se realiza desde cero y se van implementando diversas tecnologías. </p><p>Algunas de ellas son la reciente versión 6 de Foundation, ModernizrJS para la diferenciación entre dispositivos, MomentJS para el cálculo de tiempo restante para la apertura o cierre del local, entre otras diversas tecnologías ya utilizadas en proyectos anteriores. ", 
		"image": 					"factorrhcreativo-v3", 
		"link": 					"http://FactorRHcreativo.16mb.com", 
		"repo": 					"http://github.com/Fermoto5HD/RH-v3.0"
	}, {
		"type": 					"lantalks", 
		"name": 					"Loop Radio", 
		"frameworks": 				["Foundation v5", "jQuery"], 
		"datefrom": 				"2015-09-01", 
		"dateto": 					null, 
		"version": 					"v2", 
		"shortDescription": 		"Llevo a cabo el armado del sitio de Loop Radio, implementando un diseño apto para móviles y con un fuerte foco en el streaming.", 
		"description": 				"Para llevar a cabo la maquetación del sitio, Emiliano Fazzolari me pasa un boceto realizado en Photoshop para empezar a armar el layout base. Se usa Foundation v5 por usar estilos planos, ideales para este caso. Trabajé en la API de Airtime, modificando el script original e implementando una personalización para comunicar el back-end con el front-end.", 
		"image": 					"lt-loopradio-v2.0", 
		"link": 					"http://loop.lantalks.com", 
		"repo": 					"http://github.com/lantalks/web-loop"
	}, {
		"type": 					"personal", 
		"name": 					"Sitio Personal", 
		"frameworks": 				["Foundation v6", "AngularJS", "jQuery"], 
		"datefrom": 				"2015-06-01", 
		"dateto": 					"2016-06-01", 
		"version": 					"v4", 
		"shortDescription": 		"Renovación total de mi página personal, dejando atrás un layout con más de dos años de modificaciones básicas y sin un ordenamiento determinado.", 
		"description": 				"Decido renovar la estructura de mi sitio personal, haciéndolo más serio y que explique mejor quién soy yo y que es lo que hago. En un principio utilicé Foundation v5 y apenas salió Foundation v6 decidí migrar la estructura a esa nueva versión del Framework, junto con algunas incorporaciones como la sección de YouTube entre otras. ", 
		"image": 					"sitiopersonal-v4.0", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/sitiopersonal/v4", 
		"repo": 					"http://github.com/Fermoto5HD/SitioPersonal"
	}, {
		"type": 					"client", 
		"name": 					"Factor RH Creativo", 
		"datefrom": 				"2015-05-01", 
		"dateto": 					"2015-11-01", 
		"version": 					"v2", 
		"shortDescription": 		"La peluqueria mas concurrida de Villa del Parque me solicita renovar el primer diseño realizado de su sitio web. ", 
		"description": 				"Para ello decido basarme en el layout del sitio del club de programación, se adaptaron varios elementos a los colores seleccionados por los clientes. </p><p>Dicho sitio se adaptó correctamente a los lineamientos responsive y se optimizaron varias funciones internas del sitio que antes estaban desordenadas. ", 
		"image": 					"factorrhcreativo-v2", 
		"link": 					"http://FactorRHcreativo.16mb.com/v2", 
		"repo": 					"http://github.com/Fermoto5HD/RH-v2.0"
	}, {
		"type": 					"programming-club", 
		"name": 					"Club Baldomero: Tutorial Formularios", 
		"datefrom": 				"2015-04-01", 
		"dateto": 					"2015-05-01", 
		"shortDescription": 		"El objetivo de este sitio ha sido el de crear un tutorial sencillo para la creación de formularios html para contacto. ", 
		"description": 				"Este sitio usó como base el mismo layout del sitio principal del Club Baldomero, siendo también un sitio responsive. </p><p>El hecho de que sea responsive permite que el usuario pueda aprender a usar forms incluso desde cualquier dispositivo móvil. ", 
		"image": 					"clubbaldomero-forms", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/clubbaldomero-forms", 
		"repo": 					"http://github.com/Fermoto5HD/ClubBaldomero-Formularios"
	}, {
		"type": 					"programming-club", 
		"name": 					"Club Baldomero: Sitio de pruebas", 
		"datefrom": 				"2015-05-01", 
		"dateto": 					null, 
		"shortDescription": 		"Este sitio fue propuesto como objetivo para los ingresantes al club de programación por los mentores del club de la Biblioteca Baldomero.", 
		"description": 				"Este fue uno de los primeros sitios en realizarse bajo un layout desde cero. </p><p>En un principio se realizó el mismo layout propuesto por los mentores. Durante el transcurso de su realización lo transformé en responsive y le dí funcionalidad bajo Ajax. </p><p>Pero más adelante decidí adaptarlo al nuevo diseño del sitio oficial del Gobierno de la Ciudad de Buenos Aires estrenado en mayo de 2015. ", 
		"image": 					"clubbaldomero-test", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/clubbaldomero-v2.0", 
		"repo":		 				"http://github.com/Fermoto5HD/ClubBaldomero-v2.0"
	},  {
		"type": 					"personal", 
		"name": 					"Sitio Personal", 
		"datefrom": 				"2014-09-01", 
		"dateto": 					"2015-06-01", 
		"version": 					"v3.5", 
		"shortDescription": 		"Renovación de mi página personal incorporando los nuevos conocimientos de ese entonces.", 
		"description": 				"En esta etapa estaba perfeccionando mis conocimientos en programación web. Ya incorporaba los conceptos de responsive y refinaba algunos errores que cometía al programar. </p><p>El sitio fue programado en php, con incorporaciones de jQuery y elementos en CSS. </p><p>La particularidad de este sitio es que el archivo index.php se mantuvo durante muchos años. Es decir, el sitio tuvo miles de cambios significativos desde que arrancó como un simple sitio realizado con tablas. ", 
		"image": 					"sitiopersonal-v3.5", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/sitiopersonal/v3.5", 
		"repo":		 				"http://github.com/Fermoto5HD/SitioPersonal-v3.5"
	}, {
		"type": 					"client", 
		"name": 					"Factor RH Creativo", 
		"datefrom": 				"2014-06-01", 
		"dateto": 					"2015-05-01", 
		"version": 					"v1", 
		"shortDescription": 		"La peluqueria de Villa del Parque Factor RH Creativo me solicita realizar una propuesta de sitio web para darse a conocer por Internet. ", 
		"description": 				"Cabe destacar que recién en ese año empezaba a programar páginas web. No tenía mucha noción sobre el ordenado de carpetas y apenas sabía dos o tres funciones en jQuery. </p><p>El sitio se armó con PHP, con poco Javascript (más precisamente jQuery), CSS aunque desordenado, y no era responsive. </p><p>La siguiente propuesta traería muchos cambios significativos y corrección de estos puntos mencionados. ", 
		"image": 					"factorrhcreativo-v1", 
		"link": 					"http://Fermoto5HD.16mb.com/portfolio/RH-v1.0", 
		"repo":		 				null
	}
]